const persnal_short = {
  SOCE: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 감수성이 풍부합니다.",
  SOPE: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 감수성이 풍부합니다.",
  SOCR: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 침착합니다.",
  SOPR: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알고, 침착합니다.",
  SFCE: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 감수성이 풍부합니다.",
  SFPE: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 감수성이 풍부합니다. ",
  SFCR: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 침착합니다.",
  SFPR: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 침착합니다.",
  IOCE: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 감수성이 풍부합니다.",
  IOPE: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 감수성이 풍부합니다.",
  IOCR: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 침착합니다.",
  IOPR: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 침착합니다.",
  IFCE: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 감수성이 풍부합니다. ",
  IFPE: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 감수성이 풍부합니다.",
  IFCR: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위축되지 않는 용기를 보이고, 침착합니다.",
  IFPR: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 침착합니다.",
};

const persnal_long = {
  SOCE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SOPE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SOCR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐줄 수 있습니다. 자신의 감정을 이해하고 타인의 감정을 읽는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SOPR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로는 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SFCE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SFPE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SFCR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SFPR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IOCE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  IOPE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요. ",
  IOCR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐줄 수 있습니다. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IOPR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로는 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IFCE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  IFPE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요. ",
  IFCR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IFPR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
};

const behavioral_rating_scale = `adjust_school: 전반적인 학교생활 불만족과 담임 선생님과의 관계 문제, 학습의 어려움 등 학교생활 부적응 여부를 나타냅니다.
peer_relationship: 어울리는 친구의 수와 관계 만족도, 또래에게 괴롭힘을 당하거나 또래와의 싸움에 자주 연루되는지 등 전반적인 또래관계 문제 여부를 나타냅니다.
family_relationship: 가족 구성원들과의 사이, 부모님 간의 관계 갈등, 가족 구성원들이 함께 시간을 보내거나 애정을 표현하는지 등 전반적인 가족관계 문제 여부를 나타냅니다.
overall_mood: 아동의 전반적인 기분이 어떤 지를 나타냅니다.
unrest: 아동기에 보일 수 있는 일반적인 불안 증상을 나타내며, 특정 대상에 대한 공포, 분리불안, 걱정, 새로운 상황에 처하거나 낯선 사람과 교류할 때의 긴장감 등이 이에 해당합니다.
depressed: 아동기에 보일 수 있는 일반적인 우울 증상을 나타내며, 우울감, 외로움, 활력 저하, 수면과 식욕의 변화 등이 이에 해당합니다.
physical_symptoms: 아동기에 보일 수 있는 일반적인 우울 증상을 나타내며, 우울감, 외로움, 활력 저하, 수면과 식욕의 변화 등이 이에 해당합니다.
focus: 가만히 있지 못하고 꼼지락거리거나 착석 유지를 못하고 과격하거나 위험한 행동을 하는지 여부를 나타내며, 이를 높게 보고하는 아동의 경우 주의력 결핍 및 과잉행동 문제 중 ‘과잉행동’ 문제 가능성을 의심해볼 수 있습니다.
hyperactivity: 위에 제시된 요인 외에 아동 및 청소년기에 나타날 수 있는 기타 다양한 부적응 행동들을포함합니다.
aggression: 자주 짜증이나 화를 표출하고 물건을 부수거나 말다툼이나 몸싸움을 하는 등 분노 및 공격성 조절 어려움을 나타냅니다.
self_awareness: 관계, 능력, 외모 등의 중요한 자기 영역에 대한 긍정적 인식 여부를 나타냅니다.`;

const behavioral_rating_standard = `adjust_school: (score >= 7.5 === 위험), (7.5 > score >= 6.5 === 주의), (6.5 > score === 양호)  
peer_relationship: (score >= 9.5 === 위험), (9.5 > score >= 8.2 === 주의), (8.2 > score === 양호)
family_relationship: (score >= 8 === 위험), (8 > score >= 7 === 주의), (7 > score === 양호)
overall_mood: (score >= 5 === 위험), (5 > score >= 4 === 주의), (4 > score === 양호)
unrest: (score >= 10 === 위험), (10 > score >= 9 === 주의), (9 > score === 양호)
depressed: (score >= 10 === 위험), (10 > score >= 9 === 주의), (9 > score === 양호)
physical_symptoms: (score >= 7 === 위험), (7 > score >= 6 === 주의), (6 > score === 양호)
focus: (score >= 11 === 위험), (11 > score >= 9 === 주의), (9 > score === 양호)
hyperactivity: (score >= 8 === 위험), (8 > score >= 7 === 주의), (7 > score === 양호)
aggression:(score >= 8 === 위험), (8 > score >= 7 === 주의), (7 > score === 양호)
self_awareness:(score >= 7 === 위험), (7 > score >= 5.9 === 주의), (5.9 > score === 양호)`;

const behavioral_rating_prompt = {
  adjust_school:
    "user는 전반적인 학교생활 불만족과 담임 선생님과의 관계 문제, 학습의 어려움 등 학교생활 부적응 여부를 판단하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  peer_relationship:
    "user는 어울리는 친구의 수와 관계 만족도, 또래에게 괴롭힘을 당하거나 또래와의 싸움에 자주 연루되는지 등 전반적인 또래관계 문제 여부를 판단하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  family_relationship:
    "user는 가족 구성원들과의 사이, 부모님 간의 관계 갈등, 가족 구성원들이 함께 시간을 보내거나 애정을 표현하는지 등 전반적인 가족관계 문제 여부를 판단하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  overall_mood:
    "user는 아동의 전반적인 기분이 어떤지를 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  unrest:
    "user는 아동기에 보일 수 있는 일반적인 불안 증상(특정 대상에 대한 공포, 분리불안, 걱정, 새로운 상황에 처하거나 낯선 사람과 교류할 때의 긴장감 등)을 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  depressed:
    "user는 아동기에 보일 수 있는 일반적인 우울 증상(우울감, 외로움, 활력 저하, 수면과 식욕의 변화 등)을 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  physical_symptoms:
    "user는 아동기에 보일 수 있는 일반적인 우울 증상(우울감, 외로움, 활력 저하, 수면과 식욕의 변화 등)을 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  focus:
    "user는 가만히 있지 못하고 꼼지락거리거나 착석 유지를 못하고 과격하거나 위험한 행동을 하는지 여부를 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  hyperactivity:
    "user는 아동 및 청소년기에 나타날 수 있는 기타 다양한 부적응 행동들을 판단하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  aggression:
    "user는 자주 짜증이나 화를 표출하고 물건을 부수거나 말다툼이나 몸싸움을 하는 등 분노 및 공격성 조절 어려움을 확인하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  self_awareness:
    "user는 관계, 능력, 외모 등의 중요한 자기 영역에 대한 긍정적 인식 여부를 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
};

const ebt_Question = {
  school_question_0: "요즘 학교생활 하는 건 어때?",
  school_question_1: "너희반 담임 선생님은 어떠셔?",
  school_question_2: "요즘 숙제는 잘 해 가?",
  school_question_3: "수업에 집중하는 건 어때?",
  school_question_4: "너는 좋아하는 과목이 있어?",
  school_question_5: "공부 잘 하는 편이야?",
};
const ebt_Question_v2 = {
  school_question_0: "학교생활 별로야.",
  school_question_1: "담임 선생님은 별로야.",
  school_question_2: "숙제는 잘 안해.",
  school_question_3: "수업에 집중을 잘 못하겠어.",
  school_question_4: "좋아하는 과목이 없어.",
  school_question_5: "공부는 잘 못하는 편이야.",
};

const ebt_School_Result = {
  school_question_0:
    "user는 '학교생활 하는 건 어때?'라는 질문에 '별로야' 라고 답변했습니다.",
  school_question_1:
    "user는 '담임 선생님은 어떠셔?'라는 질문에 '별로야' 라고 답변했습니다.",
  school_question_2:
    "user는 '숙제는 잘 해 가?'라는 질문에 '아니 잘 안해' 라고 답변했습니다.",
  school_question_3:
    "user는 '수업에 집중하는 건 어때?'라는 질문에 '못하겠어' 라고 답변했습니다.",
  school_question_4:
    "user는 '좋아하는 과목이 있어?'라는 질문에 '없어' 라고 답변했습니다.",
  school_question_5:
    "user는 '공부 잘 하는 편이야?'라는 질문에 '아니 못해' 라고 답변했습니다.",
};
const ebt_Friend_Result = {
  friend_question_0:
    "user는 '같은 반에 친한 친구가 몇 명 있니?'라는 질문에 '하나도 없어' 라고 답변했습니다.",
  friend_question_1:
    "user는 '같은 반이 아닌 친구 중에 친한 친구가 몇 명이야?'라는 질문에 '하나도 없어' 라고 답변했습니다.",
  friend_question_2:
    "user는 '친구가 더 많았으면 좋겠니?'라는 질문에 '응 훨씬 더~' 라고 답변했습니다.",
  friend_question_3:
    "user는 '친구들과 얼마나 자주 어울려 놀아?'라는 질문에 '일주일에 1번~' 라고 답변했습니다.",
  friend_question_4:
    "user는 '친구들이랑 잘 지내는 것 같아?'라는 질문에 '아니 별로야' 라고 답변했습니다.",
  friend_question_5:
    "user는 '다른 친구들에게 인기가 많니?'라는 질문에 '아니 없어' 라고 답변했습니다.",
  friend_question_6:
    "user는 '친구들이 괴롭힐 때가 있어?'라는 질문에 '자주 있어' 라고 답변했습니다.",
  friend_question_7:
    "user는 '친구들과 싸울 때가 있니?'라는 질문에 '자주 있어' 라고 답변했습니다.",
};
const ebt_Family_Result = {
  family_question_0:
    "user는 '너와 엄마 사이는 어때?'라는 질문에 '안 좋아' 라고 답변했습니다.",
  family_question_1:
    "user는 '너와 아빠 사이는 어때?'라는 질문에 '안 좋아' 라고 답변했습니다.",
  family_question_2:
    "user는 '너와 형제자매 사이는 어때?'라는 질문에 '안 좋아' 라고 답변했습니다.",
  family_question_3:
    "user는 '부모님 사이는 어떤 것 같아?'라는 질문에 '안 좋아' 라고 답변했습니다.",
  family_question_4:
    "user는 '부모님께서 다투실 때는 없어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  family_question_5:
    "user는 '가족끼리 밥을 먹거나 대화를 나누거나 어떤 활동을 하면서 함께 시간을 보내니?'라는 질문에 '거의 없어' 라고 답변했습니다.",
  family_question_6:
    "user는 '가족끼리 서로에 대한 관심과 사랑을 표현하니?'라는 질문에 '거의 안 그래' 라고 답변했습니다.",
};
const ebt_Mood_Result = {
  mood_question_0:
    "user는 '평소 너의 기분은 어때?'라는 질문에 '안 좋아' 라고 답변했습니다.",
  mood_question_1:
    "user는 '마음이 편안하거나 기쁠 때가 있니?'라는 질문에 '거의 안 그래' 라고 답변했습니다.",
  mood_question_2:
    "user는 '마음이 불편하거나 속상할 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
};
const ebt_Unrest_Result = {
  unrest_question_0:
    "user는 '무서움을 잘 타거나 자주 깜짝깜짝 놀라니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  unrest_question_1:
    "user는 '어둠이나 귀신, 거미, 개와 같이 무서워하는 게 있어?'라는 질문에 '많이 있어' 라고 답변했습니다.",
  unrest_question_2:
    "user는 '새로운 곳에 가거나 처음 해보는 일을 할 때 어떠니?'라는 질문에 '긴장이 돼' 라고 답변했습니다.",
  unrest_question_3:
    "user는 '처음 본 사람을 만나면 얼굴이 빨개지거나 말이 잘 안 나오고 긴장돼?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  unrest_question_4:
    "user는 '무언가 안 좋은 일이 일어날까 봐 걱정을 자주 하니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  unrest_question_5:
    "user는 '부모님과 떨어지는 게 힘들어?'라는 질문에 '많이 힘들어' 라고 답변했습니다.",
};
const ebt_Sad_Result = {
  sad_question_0:
    "user는 '좋아하거나 관심 가지고 있는 게 있니?'라는 질문에 '거의 없어' 라고 답변했습니다.",
  sad_question_1:
    "user는 '슬픈 기분이 들거나 울 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  sad_question_2:
    "user는 '활기차고 기분이 좋을 때가 있니?'라는 질문에 '거의 안 그래' 라고 답변했습니다.",
  sad_question_3:
    "user는 '기운이 없고 피곤해서 아무것도 하기 싫을 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  sad_question_4:
    "user는 '아무도 나에게 관심이 없는 것 같고 외로울 때가 있니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  sad_question_5:
    "user는 '너무 많이 먹거나 너무 적게 먹을 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  sad_question_6:
    "user는 '너무 많이 자거나 너무 적게 잘 때가 있니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
};
const ebt_Health_Result = {
  health_question_0:
    "user는 '너는 네 몸이 튼튼한 것 같니?'라는 질문에 '아니' 라고 답변했습니다.",
  health_question_1:
    "user는 '머리가 아플 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  health_question_2:
    "user는 '배가 아프거나 속이 불편할 때가 있니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  health_question_3:
    "user는 '피곤하거나 쉽게 지칠 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  health_question_4:
    "user는 '여기저기 아픈 편이니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
};
const ebt_Attention_Result = {
  attention_question_0:
    "user는 '숙제 같은 걸 할 때 뭔가 빼 먹거나 실수할 때가 있니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  attention_question_1:
    "user는 '수업을 듣거나, 긴 글을 읽거나, 대화를 할 때 잘 집중하지 못하고 딴 생각을 할 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  attention_question_2:
    "user는 '숙제를 끝내야 하는데 한참 동안 딴짓을 해서 오래 걸리거나 다 끝내지 못할 때가 있니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  attention_question_3:
    "user는 '숙제를 하거나 긴 글을 읽는 것처럼 머리를 많이 쓰는 일은 어때?'라는 질문에 '너무 싫어' 라고 답변했습니다.",
  attention_question_4:
    "user는 '연필이나 실내화 가방 같이 챙겨야 할 물건을 자주 잃어버리니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  attention_question_5:
    "user는 '뭔가에 집중하다가도 주변에서 어떤 소리가 들리거나 하면 주의가 자주 흐트러지니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  attention_question_6:
    "user는 '기억해야 할 것을 자주 깜빡해?'라는 질문에 '자주 그래' 라고 답변했습니다.",
};
const ebt_Movement_Result = {
  movement_question_0:
    "user는 '손발을 가만두지 못하고 자주 꼼지락거리니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  movement_question_1:
    "user는 '수업시간 같이 가만히 앉아 있어야 할 때 허락 받지 않고 자리에서 벗어날 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  movement_question_2:
    "user는 '심하게 뛰어다니거나 위험하게 어딘가를 기어오를 때가 있니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  movement_question_3:
    "user는 '차분히 앉아서 조용하게 놀기 어려울 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  movement_question_4:
    "user는 '말이 많고 시끄러운 편이니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  movement_question_5:
    "user는 '네 차례가 올 때까지 기다리지 못할 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  movement_question_6:
    "user는 '다른 사람이 이야기 나누고 있거나 무언가 하고 있을 때 자주 방해하거나 끼어드니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
};
const ebt_Angry_Result = {
  angry_question_0:
    "user는 '짜증나거나 신경질 날 때가 있니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  angry_question_1:
    "user는 '화가 나서 큰 소리를 지를 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  angry_question_2:
    "user는 '화가 나서 물건을 던지거나 부술 때가 있니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  angry_question_3:
    "user는 '친구를 못살게 굴 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  angry_question_4:
    "user는 '형제자매와 자주 다투니?'라는 질문에 '자주 그래' 라고 답변했습니다.",
  angry_question_5:
    "user는 '부모님이나 선생님 말씀을 안 듣고 네 마음대로 할 때가 있어?'라는 질문에 '자주 그래' 라고 답변했습니다.",
};
const ebt_Self_Result = {
  self_question_0:
    "user는 '너는 네가 착하고 좋은 사람이라고 느껴져?'라는 질문에 '아니' 라고 답변했습니다.",
  self_question_1:
    "user는 '네가 사랑받는 소중한 사람이라고 느껴져?'라는 질문에 '아니' 라고 답변했습니다.",
  self_question_2:
    "user는 '네가 할 일을 항상 잘 해낼 수 있니?'라는 질문에 '아니' 라고 답변했습니다.",
  self_question_3:
    "user는 '네가 부족한 점이 많다고 생각해?'라는 질문에 '진짜 많아' 라고 답변했습니다.",
  self_question_4:
    "user는 '네 외모는 어떤 거 같아?'라는 질문에 '별로야' 라고 답변했습니다.",
};

const ebt_Analysis = {
  School: {
    role: "system",
    content: `
    다음 순서와 규칙에 따라 해석한다.
    '''
    학교생활 영역에서 '경고'나 '주의'를 받은 경우, '검사 결과, 너는 대부분의 아이들보다 학교 생활에서 어려움이 많은 것 같아'라고 한 뒤, 주요한 어려움을 따뜻한 말투로 2문장 이내로 재진술한다.
    '지금 네가 겪고 있는 어려움을 해결한다면 좀 더 편안하고 즐겁게 생활할 수 있을 거야.
    구체적으로 어떤 어려움이 있는지 엘라와 이야기하고 해결책을 찾아보자'라고 한다.
    '양호'를 받은 경우 학교 생활의 어려움이 두드러지지 않았다고 알려준다.
    공부에 자신감이 있고, 배우는 것을 좋아하고, 수업에 잘 집중하며, 숙제를 잘 챙기고, 선생님과 좋은 관계를 유지한다는 응답이 있다면 그러한 자원을 인정해준다.
    양호를 받았으나 몇 가지 어려움이 보이는 경우에는 그러한 어려움을 해석한다.
    '''
  `,
  },
  Friend: {
    role: "system",
    content: `
    다음 순서와 규칙에 따라 해석한다.
    '''
    또래관계 영역에서 '경고'를 받은 경우 "검사 결과, 또래 관계에서 어려움이 큰 편이야'라는 말로 시작한다.
    '주의'를 받은 경우 "검사 결과, 친구들과의 관계에서 조금 힘든 부분이 있구나"라는 말로 시작한다.
    '양호'를 받은 경우 "검사 결과, 친구들과 대체로 잘 지내는 것으로 보여'라고 시작한다.
    다만 양호를 받아도 5가지 이상의 어려움을 보고한 경우에는 '검사 결과, 친구들과 대체로 잘 지낸다고 했지만 몇 가지 어려움이 보여'라고 시작한다.
    현재 친구관계에 얼마나 만족하는지, 대인관계 범위가 넓은지 좁은지, 상호작용 빈도는 어느 정도인지, 대인관계 욕구 수준은 어떤지를 2문장 이내의 따뜻한 말투로 반영한다.
    괴롭힘이나 싸움 같은 부적응 문제가 있다면 언급한다.
    검사에 기초해 예상되는 정서나 행동 상의 어려움이 있다면 말해준다.
    '''
  `,
  },
  Family: {
    role: "system",
    content: `
    다음 순서에 따라 해석한다.
    '''
    가족 구성원과의 전반적인 친밀도가 높은지, 낮은지, 가족 구성원에 따라 다른지 분석한다.
    모든 구성원에게 고루 친밀감을 느끼는지, 혹은 어떤 구성원은 가깝고 어떤 구성원은 멀게 느끼는지를 덧붙인다.
    부모님 간 관계 갈등이 있는지 분석한다.
    '부모님 사이가 좋아서 가정 분위기가 편안할 것 같아'라거나, '부모님 간 갈등은 없지만 그리 친밀해보이지는 않아', '부모님 사이의 갈등이 잦아서 너를 힘들게 할 수 있겠다' 같이 부모님의 관계가 user에게 미칠 수 있는 정서적 영향을 언급한다.
    가족 구성원과의 상호작용 빈도와 애정표현의 빈도를 분석한다.
    친밀감도 높고 정서적 상호작용도 활발하다거나, 갈등이 두드러지지는 않지만 친밀한 상호작용을 늘리는 게 권장된다거나, 갈등이 잦고 불안정감을 느끼기 쉬운 분위기라는 전반적인 총평을 제시한다.
    '''
  `,
  },
  Mood: {
    role: "system",
    content: `
    다음 순서에 따라 해석한다.
    '''
    전반적인 기분 상태를 분석한다. 
    긍정 정서의 빈도를 분석한다. 
    부정 정서의 빈도를 분석한다. 
    User의 보고가 일관적이라면 종합적인 소견을 한 문장으로 제시한다. 
    비일관적이라면 그 양상과 추정되는 이유를 설명한다.
    '''
  `,
  },
  Unrest: {
    role: "system",
    content: `
    다음 순서와 규칙에 따라 해석한다.
    '''
    '슬픈 기분이 들거나 울 때가 있어?'라는 질문의 대답에 따라 우울한 마음의 빈도를 해석한다.
    '자주 그래'는 '또래 아이들에 비해 울적한 기분을 자주 느끼는 구나', '가끔 그래'는 '가끔 슬프고 울적하구나', '거의 안 그래'는 '평소에 우울한 기분은 잘 느끼지 않는 것 같아'라고 해석한다.
    '활기차고 기분이 좋을 때가 있니?', '좋아하거나 관심 가지고 있는 게 있니?'라는 두 질문으로 긍정정서의 빈도와 의욕 수준을 한 문장으로 해석한다.
    '자주' 활기차고 기분이 좋다면 긍정정서의 빈도가 높은 것이고, '가끔 그래'라고 하면 '때때로 기분이 좋고', '거의 안 그래'라고 하면 '유쾌한 기분을 거의 느끼지 못하는 것 같아 주의가 필요한' 상태이다.
    좋아하거나 관심 가지고 있는 게 '많이 있어'라고 하면 '호기심과 의욕수준이 높은 편'이고, '거의 없어'라고 하면 '의욕 수준이 낮은 편'이며, '그냥 그래'의 의미는 언급하지 않는다.
    우울한 마음과 긍정 정서가 모두 높다면 감정 기복을 경험할 가능성을 언급해준다.
    '아무도 나에게 관심이 없는 것 같고 외로울 때가 있니'라는 질문으로 외로움을 자주 느끼는지, 때때로 느끼는지 해석하고 이것이 울적한 기분에 영향을 미칠 가능성을 알려준다.
    외로움을 거의 느끼지 않는 경우에는 언급하지 않는다.
    '식욕 변화'와 '수면 곤란'이라는 키워드를 사용해 '너무 많이 먹거나 너무 적게 먹을 때가 있어?', '너무 많이 자거나 너무 적게 잘 때가 있어'라는 질문의 응답을 해석한다.
    '''
  `,
  },
  Sad: {
    role: "system",
    content: `
    다음 순서에 따라 해석한다.
    '''
    우울하고 슬픈 마음의 빈도를 해석한다.
    이와 비교하여 긍정정서의 빈도와 의욕 수준을 한 문장으로 해석한다.
    외로움의 정도를 해석하고, 외로움이 높은 경우 이러한 마음이 울적한 기분에 영향을 미칠 가능성을 알려준다.
    우울한 기분과 관련된 신체 증상의 유무(무기력해서 무언가를 할 수 없는지, 식욕 변화나 수면 곤란 유무)를 분석한다.
    '''
  `,
  },
  Health: {
    role: "system",
    content: `
    다음 순서에 따라 해석한다.
    '''
    신체적으로 건강하다는 자기인식을 가지고 있는지 여부를 해석한다.
    두통, 복통, 혹은 이유 모를 통증 등이 있는지 해석한다.
    평소 느끼는 피로도를 해석한다.
    이러한 신체 증상에 분명한 원인이 없다면 스트레스나 심리적인 이유로 몸이 아프거나 피로감이 증가할 수 있음을 알려준다.
    '''
  `,
  },
  Attention: {
    role: "system",
    content: `
    다음 순서에 따라 해석한다.
    '''
    주의집중 영역에서 '경고'를 받은 경우, '검사 결과, 주의집중의 어려움이 시사되었어.
    평소 덤벙대어 실수가 잦고, 한 가지 일에 주의를 집중하는 것이 어려워 보여.
    특히 네가 좋아하지 않는 일, 오랜 시간과 노력이 필요한 일을 할 때 쉽게 딴 생각이 나고, 그래서 더 그 일을 마치기까지 오랜 시간이 걸릴 수 있어.
    집중이 어려운 데는 몇 가지 이유가 있을 수 있으니, 종합적인 심리검사를 받아보는 것을 추천해.'라고 한다.
    주의집중 영역에서 '주의'를 받은 경우 부주의한 실수, 집중 곤란, 과제 지연, 물건을 잃어버리기 같이 보고된 어려움과 그 정도를 2문장 이내로 해석하고, '이런 모습을 볼 때 너는 꼼꼼하기보다는 좀 덤벙대고, 동시에 여러 가지 생각을 하는 스타일인 것 같아'라고 한다.
    '이러한 성향으로 어려움이 있을 때는 좀 더 종합적인 검사를 받아보면 도움이 될 거야'라고 한다.
    주의집중 영역에서 '양호'를 받은 경우, 수업시간이나 일상생활에서 주의집중과 관련된 어려움이 두드러지지 않았다고 알려준다.
    과제나 자기 물건 등을 잘 챙기고, 주의을 잘 유지하고 시간을 효율적으로 활용한다는 응답이 있다면 그러한 자원을 인정해준다.
    '''
  `,
  },
  Movement: {
    role: "system",
    content: `
    다음 규칙에 따라 해석한다.
    '''
    과잉행동 영역에서 '경고'를 받은 경우 다음의 해석을 제공한다.
    '검사 결과, 활동량이 많고 신체적 에너지 수준이 높고, 쉽게 흥분하고 활발한 성향을 지니고 있어.
    그런데 때로는 성급한 행동으로 실수를 하기도 하고, 자리에 앉아 있어야 할 때 견디기 어렵고, 말이나 행동량이 다른 사람들보다 많아서 행동 조절이 어려울 수 있어.
    만약 이와 같은 모습으로 어려움이 있고, 학교나 가정 등에서 지금보다 차분하고 조심스럽게 행동하는 게 필요한 상황이라면 전문적인 도움을 받는 것이 좋아.', '주의'를 받은 경우 다음의 해석을 제공한다.
    '검사 결과, 적극적이고 활발한 성향을 지니고 있어.'라고 한 뒤, 성급한 행동, 말이 많거나, 높은 활동량, 기다리는 것의 어려움 등이 있는지를 2문장 이내로 해석한다.
    '이러한 성향으로 어려움이 있을 때는 좀 더 종합적인 검사를 받아보면 도움이 될 거야'라고 한다.
    과잉행동 영역에서 '양호'를 받은 경우, '검사 결과, 과잉 행동 영역에서 별다른 어려움이 시사되지 않았어.
    차분하고 침착한 모습을 지니고 있는 것 같아. 다음 검사를 해보자'라고 한다.
    '''
  `,
  },
  Angry: {
    role: "system",
    content: `
    다음 순서에 따라 해석한다.
    '''
    '경고'를 받은 경우 '검사 결과, 너는 평소에 자주 화가 나고 이로 인해 행동을 조절하는데 어려움이 있는 것으로 나타났어.'라고 한다.
    짜증이나 화 같은 공격적인 감정의 빈도를 해석한다.
    물건을 던지거나 부수는 것, 친구를 괴롭히는 것, 형제자매와 자주 싸우는 것처럼 마음 속에 있는 화를 다른 사람들에게 드러내는 정도를 해석한다.
    부모님이나 선생님의 지시를 따르지 않는 정도를 해석한다.
    주변 상황에 대한 불만이나 스트레스가 화나 공격적인 행동으로 드러날 수 있음을 알려주고, 엘라와 상담을 통해 도움을 받도록 안내한다.
    '주의'를 받은 경우, 공격적인 감정의 빈도, 화를 다른 사람들에게 드러내는 정도, 윗사람의 지시를 따르는 수준을 차례로 해석한다.
    '양호'를 받은 경우, '검사 결과, 너는 네 감정을 잘 조절하고 충동적인 성향이 낮은 것으로 보여.
    그런데 상황에 따라서는 이러한 결과가 갈등이나 스트레스를 마음 속에 쌓아두고 겉으로 잘 드러내지 않는 성향을 나타낼 수도 있어.
    평소 감정을 효과적으로 표현하는 방법을 잘 알고 있는지 엘라와 함께 살펴보자'라고 한다.
    '''
  `,
  },
  Self: {
    role: "system",
    content: `
    다음 순서에 따라 해석한다.
    '''
    자신을 좋은 사람, 소중한 존재로 인식하는 자기가치감이 어느 정도인지 해석한다.
    맡은 일을 잘 해낼 수 있다는 자기효능감이 어느 정도인지 해석한다.
    자신의 단점이나 결함을 인식하는 부적절감의 정도를 해석한다.
    외모, 즉 신체적 자기상이 어떤지 해석한다.
    전반적으로 긍정적인 자기상이 형성되어 있다면 격려하고, '사람은 누구나 장단점이 있어.
    너의 장점과 너의 몇 가지 단점들을 모두 잘 이해하고 스스로를 아껴주는 사람이 되기를 바랄게'라고 한다.
    부정적인 자기상이 형성되어 있다면 '너에 대한 이런 생각이 우울한 기분이나 주변 시선을 계속 신경쓰는 것으로 이어질 수 있어.
    너의 장점들을 알아봐주고, 부족한 부분들은 어떻게 다뤄가면 좋을지 상담사 엘라가 도와줄 거야'라고 한다.
    '''
  `,
  },
};

module.exports = {
  persnal_short,
  persnal_long,
  behavioral_rating_scale,
  behavioral_rating_standard,
  behavioral_rating_prompt,
  ebt_Question,
  ebt_Question_v2,
  ebt_School_Result,
  ebt_Friend_Result,
  ebt_Family_Result,
  ebt_Mood_Result,
  ebt_Unrest_Result,
  ebt_Sad_Result,
  ebt_Health_Result,
  ebt_Attention_Result,
  ebt_Movement_Result,
  ebt_Angry_Result,
  ebt_Self_Result,
  ebt_Analysis,
};
