const persnal_short = {
  SOCE: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 감수성이 풍부합니다.",
  SOPE: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 감수성이 풍부합니다.",
  SOCR: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 침착합니다.",
  SOPR: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알고, 침착합니다.",
  SFCE: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 감수성이 풍부합니다.",
  SFPE: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 감수성이 풍부합니다. ",
  SFCR: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 침착합니다.",
  SFPR: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 침착합니다.",
  IOCE: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 감수성이 풍부합니다.",
  IOPE: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 감수성이 풍부합니다.",
  IOCR: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 침착합니다.",
  IOPR: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 침착합니다.",
  IFCE: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 감수성이 풍부합니다. ",
  IFPE: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 감수성이 풍부합니다.",
  IFCR: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위축되지 않는 용기를 보이고, 침착합니다.",
  IFPR: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 침착합니다.",
};

const persnal_long = {
  SOCE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SOPE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SOCR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐줄 수 있습니다. 자신의 감정을 이해하고 타인의 감정을 읽는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SOPR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로는 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SFCE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SFPE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SFCR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SFPR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IOCE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  IOPE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요. ",
  IOCR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐줄 수 있습니다. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IOPR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로는 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IFCE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  IFPE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요. ",
  IFCR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IFPR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
};

module.exports = {
  persnal_short,
  persnal_long,
};
