const persnal_short = {
  SOCE: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 감수성이 풍부합니다.",
  SOPE: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 감수성이 풍부합니다.",
  SOCR: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 침착합니다.",
  SOPR: "다른 사람들과 어울리는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알고, 침착합니다.",
  SFCE: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 감수성이 풍부합니다.",
  SFPE: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 감수성이 풍부합니다. ",
  SFCR: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 침착합니다.",
  SFPR: "다른 사람들과 어울리는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 침착합니다.",
  IOCE: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 감수성이 풍부합니다.",
  IOPE: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 감수성이 풍부합니다.",
  IOCR: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기며, 위축되지 않는 용기를 보이고, 침착합니다.",
  IOPR: "독립적으로 활동하는 것을 좋아하고, 모험을 즐기면서도, 위험에 대비할 줄 알며, 침착합니다.",
  IFCE: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하면서도, 위축되지 않는 용기를 보이며, 감수성이 풍부합니다. ",
  IFPE: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 감수성이 풍부합니다.",
  IFCR: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위축되지 않는 용기를 보이고, 침착합니다.",
  IFPR: "독립적으로 활동하는 것을 좋아하고, 익숙함을 추구하며, 위험에 대비할 줄 알고, 침착합니다.",
};

const persnal_long = {
  SOCE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SOPE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SOCR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐줄 수 있습니다. 자신의 감정을 이해하고 타인의 감정을 읽는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SOPR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로는 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SFCE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SFPE: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  SFCR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  SFPR: "상대방에게 맞춰주거나 분위기를 따르려는 과정에서 자기주장에 어려움을 겪을 수 있어 적절한 자기주장 훈련이 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IOCE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  IOPE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요. ",
  IOCR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐줄 수 있습니다. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IOPR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로는 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IFCE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려 주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습이며, 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요.",
  IFPE: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 지루하거나 엄격한 규칙이 있는 상황에서 인내심을 기를 수 있도록 도와주세요. 한편으로 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 때로는 차분하게 감정을 다스리며 이성적으로 생각하고 행동하는 것도 중요하다는 것을 가르쳐주세요. ",
  IFCR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려주시는 것이 좋습니다. 예상할 수 있는 위험에 대비하며 신중하게 대처하는 것도 용기 있는 사람의 한 모습임을 가르쳐주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
  IFPR: "또래에게 관심이 없거나 소수의 친구와만 사귀려고 하는 모습을 보여 연령에 맞는 사회성 계발이 부족할 수 있으므로 보호자가 아동과 성향이 맞는 친구를 매칭해주고 함께 시간을 보낼 수 있도록 독려할 필요가 있으며 적절한 사회기술 훈련도 도움이 될 수 있습니다. 변화나 새로움에 처음에는 저항적인 태도를 보일 수 있으니 천천히 익숙해질 수 있도록 인내심을 가지고 기다려주시는 것이 좋습니다. 지나치게 걱정하거나 조심하는 태도로 인하여 자주 긴장하고 불안해하며 위축된 모습을 보일 수 있으므로 아동이 보호자를 안전기지 삼아 용기를 내고 상황의 좋은 점에도 주목할 수 있도록 격려해주세요. 자신의 감정을 이해하고 표현하는 데에 서툴기 때문에 감정에 대한 교육이 필요하며 일상생활에서 감정 표현을 할 수 있도록 대화를 많이 나누시는 것이 좋겠습니다. ",
};

const behavioral_rating_scale = `adjust_school: 전반적인 학교생활 불만족과 담임 선생님과의 관계 문제, 학습의 어려움 등 학교생활 부적응 여부를 나타냅니다.
peer_relationship: 어울리는 친구의 수와 관계 만족도, 또래에게 괴롭힘을 당하거나 또래와의 싸움에 자주 연루되는지 등 전반적인 또래관계 문제 여부를 나타냅니다.
family_relationship: 가족 구성원들과의 사이, 부모님 간의 관계 갈등, 가족 구성원들이 함께 시간을 보내거나 애정을 표현하는지 등 전반적인 가족관계 문제 여부를 나타냅니다.
overall_mood: 아동의 전반적인 기분이 어떤 지를 나타냅니다.
unrest: 아동기에 보일 수 있는 일반적인 불안 증상을 나타내며, 특정 대상에 대한 공포, 분리불안, 걱정, 새로운 상황에 처하거나 낯선 사람과 교류할 때의 긴장감 등이 이에 해당합니다.
depressed: 아동기에 보일 수 있는 일반적인 우울 증상을 나타내며, 우울감, 외로움, 활력 저하, 수면과 식욕의 변화 등이 이에 해당합니다.
physical_symptoms: 아동기에 보일 수 있는 일반적인 우울 증상을 나타내며, 우울감, 외로움, 활력 저하, 수면과 식욕의 변화 등이 이에 해당합니다.
focus: 가만히 있지 못하고 꼼지락거리거나 착석 유지를 못하고 과격하거나 위험한 행동을 하는지 여부를 나타내며, 이를 높게 보고하는 아동의 경우 주의력 결핍 및 과잉행동 문제 중 ‘과잉행동’ 문제 가능성을 의심해볼 수 있습니다.
hyperactivity: 위에 제시된 요인 외에 아동 및 청소년기에 나타날 수 있는 기타 다양한 부적응 행동들을포함합니다.
aggression: 자주 짜증이나 화를 표출하고 물건을 부수거나 말다툼이나 몸싸움을 하는 등 분노 및 공격성 조절 어려움을 나타냅니다.
self_awareness: 관계, 능력, 외모 등의 중요한 자기 영역에 대한 긍정적 인식 여부를 나타냅니다.`;

const behavioral_rating_standard = `adjust_school: (score >= 7.5 === 위험), (7.5 > score >= 6.5 === 주의), (6.5 > score === 양호)  
peer_relationship: (score >= 9.5 === 위험), (9.5 > score >= 8.2 === 주의), (8.2 > score === 양호)
family_relationship: (score >= 8 === 위험), (8 > score >= 7 === 주의), (7 > score === 양호)
overall_mood: (score >= 5 === 위험), (5 > score >= 4 === 주의), (4 > score === 양호)
unrest: (score >= 10 === 위험), (10 > score >= 9 === 주의), (9 > score === 양호)
depressed: (score >= 10 === 위험), (10 > score >= 9 === 주의), (9 > score === 양호)
physical_symptoms: (score >= 7 === 위험), (7 > score >= 6 === 주의), (6 > score === 양호)
focus: (score >= 11 === 위험), (11 > score >= 9 === 주의), (9 > score === 양호)
hyperactivity: (score >= 8 === 위험), (8 > score >= 7 === 주의), (7 > score === 양호)
aggression:(score >= 8 === 위험), (8 > score >= 7 === 주의), (7 > score === 양호)
self_awareness:(score >= 7 === 위험), (7 > score >= 5.9 === 주의), (5.9 > score === 양호)`;

const behavioral_rating_prompt = {
  adjust_school:
    "user는 전반적인 학교생활 불만족과 담임 선생님과의 관계 문제, 학습의 어려움 등 학교생활 부적응 여부를 판단하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  peer_relationship:
    "user는 어울리는 친구의 수와 관계 만족도, 또래에게 괴롭힘을 당하거나 또래와의 싸움에 자주 연루되는지 등 전반적인 또래관계 문제 여부를 판단하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  family_relationship:
    "user는 가족 구성원들과의 사이, 부모님 간의 관계 갈등, 가족 구성원들이 함께 시간을 보내거나 애정을 표현하는지 등 전반적인 가족관계 문제 여부를 판단하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  overall_mood:
    "user는 아동의 전반적인 기분이 어떤지를 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  unrest:
    "user는 아동기에 보일 수 있는 일반적인 불안 증상(특정 대상에 대한 공포, 분리불안, 걱정, 새로운 상황에 처하거나 낯선 사람과 교류할 때의 긴장감 등)을 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  depressed:
    "user는 아동기에 보일 수 있는 일반적인 우울 증상(우울감, 외로움, 활력 저하, 수면과 식욕의 변화 등)을 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  physical_symptoms:
    "user는 아동기에 보일 수 있는 일반적인 우울 증상(우울감, 외로움, 활력 저하, 수면과 식욕의 변화 등)을 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  focus:
    "user는 가만히 있지 못하고 꼼지락거리거나 착석 유지를 못하고 과격하거나 위험한 행동을 하는지 여부를 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  hyperactivity:
    "user는 아동 및 청소년기에 나타날 수 있는 기타 다양한 부적응 행동들을 판단하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  aggression:
    "user는 자주 짜증이나 화를 표출하고 물건을 부수거나 말다툼이나 몸싸움을 하는 등 분노 및 공격성 조절 어려움을 확인하는 검사에서 위험군에 속하는 결과가 나왔습니다.",
  self_awareness:
    "user는 관계, 능력, 외모 등의 중요한 자기 영역에 대한 긍정적 인식 여부를 나타내는 검사에서 위험군에 속하는 결과가 나왔습니다.",
};

const ebt_Question = {
  school_question_0: "요즘 학교생활 하는 건 어때?",
  school_question_1: "너희반 담임 선생님은 어떠셔?",
  school_question_2: "요즘 숙제는 잘 해 가?",
  school_question_3: "수업에 집중하는 건 어때?",
  school_question_4: "너는 좋아하는 과목이 있어?",
  school_question_5: "공부 잘 하는 편이야?",
};

module.exports = {
  persnal_short,
  persnal_long,
  behavioral_rating_scale,
  behavioral_rating_standard,
  behavioral_rating_prompt,
  ebt_Question,
};
